# string = "открытое акционерное общество"

# sttr = "".join([x[0].upper() for x in string.split()])

# print(sttr)

"".join([x[0].upper() for x in string.split()])

"""
Аббревиатура
Вашему решению предоставлена строка string.

Напишите выражение для генерации строки, представляющей собой аббревиатуру заданной.

Примечание
В решении не должно быть ничего, кроме выражения.

Пример 1
Ввод
string = 'Российская Федерация'
Вывод
'РФ'

Пример 2
Ввод
string = 'открытое акционерное общество'
Вывод
'ОАО'
"""
