readed_str = input()

# Разбиваем строку на числа и парсим строки как числа.
list_of_items = readed_str.split("; ")

for i in range(len(list_of_items)):
    list_of_items[i] = int(list_of_items[i])

list_of_items.sort()

# Инициализируем словарь
dict_of_mult = dict()
for itemm in list_of_items:
    dict_of_mult[itemm] = set()

# Ищем множители.
for m in list_of_items:
    tmp = int((m**0.5))
    for k in range(2, tmp + 1):
        if m % k == 0:
            dict_of_mult[m].add(k)
            second_mult = m // k
            dict_of_mult[m].add(second_mult)
    dict_of_mult[m].add(m)

# Инициализируем итоговый/результирующий словарь
second_dict = dict()
for dict in dict_of_mult:
    second_dict[dict] = list()

# Наполняем итоговый/результирующий словарь
for y in dict_of_mult:
    for w in dict_of_mult:
        if y == w:
            continue
        sett = dict_of_mult[y] & dict_of_mult[w]
        if len(sett) == 0:
            second_dict[y].append(w)

# Печать итогового словаря
for q in second_dict:
    current_list = second_dict[q]
    if len(current_list) == 0:
        continue
    current_list.sort()
    print(f"{q} - ", end="")
    for r in current_list:
        sepp = ", "
        if r == current_list[-1]:
            sepp = ""
        print(f"{r}{sepp}", end="")
    print()


"""
Простая задача 4.0
Напомним, что взаимно простыми называются числа, которые не имеют общих делителей кроме 1. Напишите программу, которая для каждого переданного числа находит список его взаимно простых.

Формат ввода
Задана последовательность чисел записанных через точку с запятой (;) и пробел.

Формат вывода
Список чисел с указанием взаимно простых ему среди переданных.
Все числа должны быть выведены в порядке возрастания без повторений.
Строки следует отформатировать по правилу:
число - взаимно простое 1, взаимно простое 2, ...
Если для числа не было найдено ни одного взаимно простого, то и выводить его не требуется.

Пример 1
Ввод
2; 3; 4; 5; 6; 7; 8; 9; 10; 11; 12; 13; 14; 15; 16; 17; 18; 19; 20
Вывод
2 - 3, 5, 7, 9, 11, 13, 15, 17, 19
3 - 2, 4, 5, 7, 8, 10, 11, 13, 14, 16, 17, 19, 20
4 - 3, 5, 7, 9, 11, 13, 15, 17, 19
5 - 2, 3, 4, 6, 7, 8, 9, 11, 12, 13, 14, 16, 17, 18, 19
6 - 5, 7, 11, 13, 17, 19
7 - 2, 3, 4, 5, 6, 8, 9, 10, 11, 12, 13, 15, 16, 17, 18, 19, 20
8 - 3, 5, 7, 9, 11, 13, 15, 17, 19
9 - 2, 4, 5, 7, 8, 10, 11, 13, 14, 16, 17, 19, 20
10 - 3, 7, 9, 11, 13, 17, 19
11 - 2, 3, 4, 5, 6, 7, 8, 9, 10, 12, 13, 14, 15, 16, 17, 18, 19, 20
12 - 5, 7, 11, 13, 17, 19
13 - 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 14, 15, 16, 17, 18, 19, 20
14 - 3, 5, 9, 11, 13, 15, 17, 19
15 - 2, 4, 7, 8, 11, 13, 14, 16, 17, 19
16 - 3, 5, 7, 9, 11, 13, 15, 17, 19
17 - 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 18, 19, 20
18 - 5, 7, 11, 13, 17, 19
19 - 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 20
20 - 3, 7, 9, 11, 13, 17, 19

Пример 2
Ввод
7; 2; 2; 12; 14; 7; 2; 49
Вывод
2 - 7, 49
7 - 2, 12
12 - 7, 49
49 - 2, 12
"""