# n = 4
# str = [[x * y for x in range(1, n + 1)] for y in range(1, n + 1)]
# print(str)

[[x * y for x in range(1, n + 1)] for y in range(1, n + 1)]

"""
Таблица умножения 2.0
Вашему решению будет предоставлена единственная переменная n — необходимый размер таблицы умножения.

Напишите списочное выражения для генерации таблицы умножения.

Примечание
В решении не должно быть ничего, кроме списочного выражения.

Пример 1
Ввод
n = 3
Вывод
[[1, 2, 3], [2, 4, 6], [3, 6, 9]]

Пример 2
Ввод
n = 4
Вывод
[[1, 2, 3, 4], [2, 4, 6, 8], [3, 6, 9, 12], [4, 8, 12, 16]]
"""