# numbers = [1, 2, 3, 4, 5]
# str = set([x for x in numbers if x % 2 != 0])
# print(str)

set([x for x in numbers if x % 2 != 0])


"""
Множество нечетных чисел
Вашему решению будет предоставлен список numbers, содержащий натуральные числа.

Напишите выражение для генерации множества всех нечётных чисел среди переданных.

Примечание
В решении не должно быть ничего, кроме выражения.

Пример 1
Ввод
numbers = [1, 2, 3, 4, 5]
Вывод
{1, 3, 5}

Пример 2
Ввод
numbers = [1, 2, 3, 2, 1, 2, 3, 2, 1, 2]
Вывод
{1, 3}
"""
